БИТУправление_медицинским_центром_демо/src/DataProcessors/ФормированиеДокументовПоступленияУслугЛабораторий/ФормированиеДокументовПоступленияУслугЛабораторий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормированиеДокументовПоступленияУслугЛабораторий</name>
</mdclass:DataProcessor>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Прейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВидыСертификатов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/СостоянияЗаказовЛаборатории/СостоянияЗаказовЛаборатории.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЗаказовЛаборатории</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>ПолученРезультат</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ВариантыПолучателяПоступившихЗатрат/ВариантыПолучателяПоступившихЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыПолучателяПоступившихЗатрат</name>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураЗатраты</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Documents/ОписьЗаказовЛаборатории/ОписьЗаказовЛаборатории.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОписьЗаказовЛаборатории</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ЛабораторныеИсследования</registerRecords>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Лаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЗаказов</name>
    <attributes>
      <name>ЗаказВЛабораторию</name>
      <type>
        <types>DocumentRef.ЗаказВоВнешнююЛабораторию</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/ЗаказВоВнешнююЛабораторию/ЗаказВоВнешнююЛабораторию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказВоВнешнююЛабораторию</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ЛабораторныеИсследования</registerRecords>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗаказовЛаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьРезультат</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Лаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>Анонимно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказаВнешнейЛаборатории</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Исследования</name>
    <attributes>
      <name>КодПробы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияЗаказовЛаборатории</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Результаты</name>
    <attributes>
      <name>КодПробы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/ПоступлениеТоваровУслуг/ПоступлениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <comment>(Общ) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <comment>(Общ) </comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПолучателяЗатрат</name>
    <type>
      <types>EnumRef.ВариантыПолучателяПоступившихЗатрат</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>Таблица товаров и услуг</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (материал или услуга)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияВыработки</name>
      <type>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПолучатель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/DataProcessors/ФормированиеДокументовПоступленияУслугЛабораторий/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьОписи(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьТаблицу();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПоступление(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	Поступление = СоздатьДокументПоступлениеПоОписям(ОтправленныеОписи, Прейскурант, Контрагент, Комментарий, СтатьяЗатрат);
	
	ОткрытьЗначение(Поступление);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	СформироватьКомментарий();
КонецПроцедуры

&НаКлиенте
Процедура ЛабораторияПриИзменении(Элемент)
	СформироватьКомментарий();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицу()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ОписьЗаказовЛабораторииСписокЗаказов.Ссылка КАК Ссылка,
	                      |	ОписьЗаказовЛабораторииСписокЗаказов.ЗаказВЛабораторию КАК ЗаказВЛабораторию
	                      |ПОМЕСТИТЬ Описи
	                      |ИЗ
	                      |	Документ.ОписьЗаказовЛаборатории.СписокЗаказов КАК ОписьЗаказовЛабораторииСписокЗаказов
	                      |ГДЕ
	                      |	НЕ ОписьЗаказовЛабораторииСписокЗаказов.ЗаказВЛабораторию.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовЛаборатории.Отменен)
	                      |	И НЕ ОписьЗаказовЛабораторииСписокЗаказов.ЗаказВЛабораторию.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовЛаборатории.Создан)
	                      |	И ОписьЗаказовЛабораторииСписокЗаказов.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	                      |	И ОписьЗаказовЛабораторииСписокЗаказов.Ссылка.Лаборатория = &Лаборатория
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Описи.Ссылка КАК Ссылка,
	                      |	СУММА(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)) КАК Сумма
	                      |ИЗ
	                      |	Описи КАК Описи
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказВоВнешнююЛабораторию.Исследования КАК ЗаказВоВнешнююЛабораториюИсследования
	                      |		ПО (ЗаказВоВнешнююЛабораториюИсследования.Ссылка = Описи.ЗаказВЛабораторию)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Прейскурант = &Прейскурант) КАК ЦеныНоменклатурыСрезПоследних
	                      |		ПО (ЗаказВоВнешнююЛабораториюИсследования.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Описи.Ссылка");
	
	Запрос.УстановитьПараметр("Период", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Лаборатория", Лаборатория);
	Запрос.УстановитьПараметр("Прейскурант", Прейскурант);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Стр = ОтправленныеОписи.Добавить();	
		Стр.Опись = Выборка.Ссылка;
		Стр.Сумма = Выборка.Сумма;
	КонецЦикла;	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКомментарий()
	
	Если ЗначениеЗаполнено(Лаборатория) И ЗначениеЗаполнено(Период) Тогда
		Комментарий = "Описи за период от " + Формат(Период.ДатаНачала, "ДФ=dd.MM.yyyy") + " до " 
			+ Формат(Период.ДатаОкончания, "ДФ=dd.MM.yyyy") + " по лаборатории " + Лаборатория;		    	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьДокументПоступлениеПоОписям(Знач Описи, Прейскурант, Контрагент, Комментарий, СтатьяЗатрат)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Поступление = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
	
	Поступление.Комментарий 			= Комментарий;
	Поступление.Контрагент 				= Контрагент;
	Поступление.Филиал 					= УправлениеНастройками.ПолучитьФилиалПоУмолчаниюПользователя();
	Поступление.Дата 					= ТекущаяДатаСеанса();
	Поступление.ВариантПолучателяЗатрат = Перечисления.ВариантыПолучателяПоступившихЗатрат.НоменклатураЗатраты;
	
	СуммаДокумента = 0;
	
	Для Каждого СтрОписи Из Описи Цикл
		Для Каждого СтрЗаказы Из СтрОписи.Опись.СписокЗаказов Цикл
			Для Каждого	СтрИсследования Из СтрЗаказы.ЗаказВЛабораторию.Исследования Цикл	
				
				Рез = Поступление.Услуги.Найти(СтрИсследования.Номенклатура, "Номенклатура");
				
				Если Рез = Неопределено Тогда
									
					Стр = Поступление.Услуги.Добавить();
					Стр.Номенклатура= СтрИсследования.Номенклатура;
					Стр.Цена 		= Ценообразование.ПолучитьЦену(Прейскурант, Стр.Номенклатура).Цена;
					Стр.Количество	= 1;
					Стр.Сумма 		= Стр.Цена * Стр.Количество;
					Стр.СтатьяЗатрат= СтатьяЗатрат;
					
					СуммаДокумента 	= СуммаДокумента + Стр.Сумма;

				Иначе	
					
					Рез.Количество 	= Рез.Количество + 1;
					Рез.Сумма 		= Рез.Цена * Рез.Количество; 
					
					СуммаДокумента 	= СуммаДокумента + Рез.Цена;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Поступление.СуммаДокумента = СуммаДокумента;
	
	Поступление.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Поступление.Ссылка;
	
КонецФункции

#КонецОбласти
